package CommandMethods;

import Network.Response;

public class HelpCommand implements Command {
    @Override
    public Response execute() {
        return new Response(true, """
                Список команд:
                help : вывести справку по доступным командам
                info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов)
                show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении
                add {element} : добавить новый элемент в коллекцию
                add_random [count] : добавить один или несколько случайных элементов
                update id {element} : обновить значение элемента коллекции, id которого равен заданному
                remove_by_id id : удалить элемент из коллекции по его id
                clear : очистить коллекцию
                save : сохранить коллекцию в файл
                execute_script file_name : считать и исполнить скрипт из указанного файла
                exit : завершить программу (с сохранением в файл на сервере)
                remove_last : удалить последний элемент из коллекции
                add_if_min {element} : добавить новый элемент в коллекцию, если его значение меньше, чем у наименьшего элемента этой коллекции
                shuffle : перемешать элементы коллекции в случайном порядке
                filter_less_than_venue venue : вывести элементы, значение поля venue которых меньше заданного
                filter_greater_than_venue venue : вывести элементы, значение поля venue которых больше заданного
                print_field_descending_price : вывести значения поля price всех элементов в порядке убывания""");
    }
}
